Revit 2026 API

# XYZIsAlmostEqualTo(XYZ) Method

---

Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAlmostEqualTo(
	XYZ source
)
```
```vb
Public Function IsAlmostEqualTo (
	source As XYZ
) As Boolean
```
```cpp
public:
bool IsAlmostEqualTo(
	XYZ^ source
)
```
```fsharp
member IsAlmostEqualTo :
        source : XYZ -> bool
```

#### Parameters

source XYZ
    The vector to compare with this vector.

#### Return Value

BooleanTrue if the vectors are the same; otherwise, false.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

This routine uses Revit's default tolerance to compare two vectors to see if they are almost equivalent. Because the tolerance is small enough this can also be used to compare two points.

#### Reference

XYZ Class

IsAlmostEqualTo Overload

Autodesk.Revit.DB Namespace